title: RegistryEvents
operating_system: windows
data_channel: windowsdefenderatp
description: Creation and modification of registry entries
data_fields:
- standard_name: event_date_creation
  field_name: EventTime
  type: date
  description: Date and time when the event was recorded
  sample_value: ''
- standard_name: machine_id
  field_name: MachineId
  type: string
  description: Unique identifier for the machine in the service
  sample_value: ''
- standard_name: computer_name
  field_name: ComputerName
  type: string
  description: Fully qualified domain name (FQDN) of the machine
  sample_value: ''
- standard_name: action_type
  field_name: ActionType
  type: string
  description: Type of activity that triggered the event
  sample_value: ''
- standard_name: registry_key_path
  field_name: RegistryKey
  type: string
  description: Registry key that the recorded action was applied to
  sample_value: ''
- standard_name: registry_value_type
  field_name: RegistryValueType
  type: string
  description: Data type, such as binary or string, of the registry value that the
    recorded action was applied to
  sample_value: ''
- standard_name: registry_value_name
  field_name: RegistryValueName
  type: string
  description: Name of the registry value that the recorded action was applied to
  sample_value: ''
- standard_name: registry_value_data
  field_name: RegistryValueData
  type: string
  description: Data of the registry value that the recorded action was applied to
  sample_value: ''
- standard_name: previous_registry_value_name
  field_name: PreviousRegistryValueName
  type: string
  description: Original name of the registry value before it was modified
  sample_value: ''
- standard_name: previous_registry_value_data
  field_name: PreviousRegistryValueData
  type: string
  description: Original data of the registry value before it was modified
  sample_value: ''
- standard_name: user_domain
  field_name: InitiatingProcessAccountDomain
  type: string
  description: Domain of the account that ran the process responsible for the event
  sample_value: ''
- standard_name: user_name
  field_name: InitiatingProcessAccountName
  type: string
  description: User name of the account that ran the process responsible for the event
  sample_value: ''
- standard_name: user_sid
  field_name: InitiatingProcessAccountSid
  type: string
  description: Security Identifier (SID) of the account that ran the process responsible
    for the event
  sample_value: ''
- standard_name: hash_sha1
  field_name: InitiatingProcessSHA1
  type: string
  description: SHA-1 of the process (image file) that initiated the event
  sample_value: ''
- standard_name: hash_md5
  field_name: InitiatingProcessMD5
  type: string
  description: MD5 hash of the process (image file) that initiated the event
  sample_value: ''
- standard_name: process_name
  field_name: InitiatingProcessFileName
  type: string
  description: Name of the process that initiated the event
  sample_value: ''
- standard_name: process_id
  field_name: InitiatingProcessId
  type: int
  description: Process ID (PID) of the process that initiated the event
  sample_value: ''
- standard_name: process_command_line
  field_name: InitiatingProcessCommandLine
  type: string
  description: Command line used to run the process that initiated the event
  sample_value: ''
- standard_name: process_creation_time
  field_name: InitiatingProcessCreationTime
  type: date
  description: Date and time when the process that initiated the event was started
  sample_value: ''
- standard_name: process_path
  field_name: InitiatingProcessFolderPath
  type: string
  description: Folder containing the process (image file) that initiated the event
  sample_value: ''
- standard_name: process_parent_id
  field_name: InitiatingProcessParentId
  type: int
  description: Process ID (PID) of the parent process that spawned the process responsible
    for the event
  sample_value: ''
- standard_name: process_parent_name
  field_name: InitiatingProcessParentFileName
  type: string
  description: Name of the parent process that spawned the process responsible for
    the event
  sample_value: ''
- standard_name: process_parent_creation_time
  field_name: InitiatingProcessParentCreationTime
  type: date
  description: Date and time when the parent of the process responsible for the event
    was started
  sample_value: ''
- standard_name: process_integrity_level
  field_name: InitiatingProcessIntegrityLevel
  type: string
  description: Integrity level of the process that initiated the event. Windows assigns
    integrity levels to processes based on certain characteristics, such as if they
    were launched from an internet download. These integrity levels influence permissions
    to resources.
  sample_value: ''
- standard_name: process_token_elevation
  field_name: InitiatingProcessTokenElevation
  type: string
  description: Token type indicating the presence or absence of User Access Control
    (UAC) privilege elevation applied to the process that initiated the event
  sample_value: ''
- standard_name: report_id
  field_name: ReportId
  type: long
  description: Event identifier based on a repeating counter. To identify unique events,
    this column must be used in conjunction with the ComputerName and EventTime columns.
  sample_value: ''
- standard_name: app_guard_container_id
  field_name: AppGuardContainerId
  type: string
  description: Identifier for the virtualized container used by Application Guard
    to isolate browser activity
  sample_value: ''
resources: []
tags: []
